/* Array.splice(start, deleteCount, item...)最主要的作用就是:从一个数组中删除一个元素
============================================================================================================
Array.splice()，从array中移除一个或多个元素，并用新的item替换它们。
三个参数：
参数start：从array中移除元素的位置开始，包括该位置。
参数deleteCount：要移除元素的个数，多少个
如果有额外的参数，即参数item...，这些item会插入到被移除元素的位置上
返回值：被移除的元素组成的数组
改变原数组的长度
============================================================================================================
*/

let arr = [3, 'd', 91, 34, [56, 'fd']];
console.log(arr.splice(-1, 2, 'ache', 'chan', [2,3])); //[ [ 56, 'fd' ] ] <-------注意返回值
console.log(arr); //原数组改变

